app/views/movies/_form.html.erb

SELECT "venues".* FROM "venues" ORDER BY "venues"."name" ASC
---
  <%= form.label :venue %><br>
  <%= form.collection_select :venue_id, Venue.order(:name),:id,:name, {:include_blank => "Select Venue", :required => true } , {class: "col-xs-3"} %>