app/controllers/movies_controller.rb

INSERT INTO "movies" ("movie_name", "summary", "genre", "year", "imdb", "created_at", "updated_at", "venue_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @movie = Movie.new(movie_params)
    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "venue_id" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["venue_id", 2], ["updated_at", "2020-05-19 12:33:13.676691"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)