app/controllers/seats_controller.rb

SELECT "seats".* FROM "seats" WHERE "seats"."movie_id" = $1  [["movie_id", 1]]
---
  def index
    @seats = Seat.where(movie: @movie)

SELECT "seats".* FROM "seats" WHERE "seats"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "seats" SET "status" = $1 WHERE "seats"."id" = $2  [["status", "UNAVAILABLE"], ["id", 26]]
---
  def update
    seat = Seat.find(params[:id])
    respond_to do |format|
      if seat.update(status: params[:status])