app/controllers/venues_controller.rb

  def create
    @venue = Venue.new(venue_params)
    respond_to do |format|
      if @venue.save
---
INSERT INTO "venues" ("rows", "columns", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rows", 2], ["columns", 6], ["name", "B"], ["created_at", "2020-05-19 12:33:01.757813"], ["updated_at", "2020-05-19 12:33:01.757813"]]

  def update
    respond_to do |format|
      if @venue.update(venue_params)
---
UPDATE "venues" SET "name" = $1, "updated_at" = $2 WHERE "venues"."id" = $3  [["name", "A1"], ["updated_at", "2020-05-20 19:28:36.049173"], ["id", 1]]

    def set_venue
      @venue = Venue.find(params[:id])
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]