app/controllers/welcome_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def get_seats
    @movie = Movie.find_by(id: params[:form][:movie_id])

UPDATE "seats" SET "status" = $1 WHERE "seats"."movie_id" = $2 AND "seats"."seat_combination" = $3  [["status", "BOOKED"], ["movie_id", 3], ["seat_combination", "a6a7a8"]]
---
  def book_seats
    @seats = params[:seats].split(",").join("").split(",")
    Seat.where(movie_id: @movie.id, seat_combination: @seats).update_all(status: "BOOKED")