app/controllers/concerns/seat_allocator_concern.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_seats(no_of_seats = 1, id)
    no_of_seats = no_of_seats.to_i
    @movie = Movie.find_by(id: id)